tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/iglooWithFridges/0/T
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 265;

boundaryField
{
    ground
    {
        type            fixedValue;
        value           uniform 265;
    }

    igloo_region0
    {
        type            fixedValue;
        value           uniform 265;
    }

    twoFridgeFreezers_seal_0
    {
        type            fixedValue;
        value           uniform 303;
    }

    twoFridgeFreezers_herring_1
    {
        type            fixedValue;
        value           uniform 303;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
